# Agenda

1. Pivot tables
2. Stack, unstack, melt
3. Joins
4. `filter` on columns

In [1]:
import numpy as np
import pandas as pd 
from pandas import Series, DataFrame

In [2]:
df = DataFrame(np.random.randint(0, 1000, [4,5]),
              index=list('abcd'),
              columns=list('vwxyz'))
df

     v    w    x    y    z
a  906  704  539  445  618
b  692  477  543  649  594
c  853  732  548  193  643
d  501  406  614  962  466

In [3]:
df.loc['e'] = [1,2,3,4,5]
df

     v    w    x    y    z
a  906  704  539  445  618
b  692  477  543  649  594
c  853  732  548  193  643
d  501  406  614  962  466
e    1    2    3    4    5

In [4]:
new_row = {'w':20, 'x':30, 'z':50}
df.loc['f'] = new_row

In [5]:
df

       v    w    x      y    z
a  906.0  704  539  445.0  618
b  692.0  477  543  649.0  594
c  853.0  732  548  193.0  643
d  501.0  406  614  962.0  466
e    1.0    2    3    4.0    5
f    NaN   20   30    NaN   50

In [6]:
df['w'] = [10, 20, 30, 40, 50, 60]
df

       v   w    x      y    z
a  906.0  10  539  445.0  618
b  692.0  20  543  649.0  594
c  853.0  30  548  193.0  643
d  501.0  40  614  962.0  466
e    1.0  50    3    4.0    5
f    NaN  60   30    NaN   50

In [7]:
df['u'] = {'a':100, 'c':300, 'e':500}

In [8]:
df

       v   w    x      y    z      u
a  906.0  10  539  445.0  618  100.0
b  692.0  20  543  649.0  594    NaN
c  853.0  30  548  193.0  643  300.0
d  501.0  40  614  962.0  466    NaN
e    1.0  50    3    4.0    5  500.0
f    NaN  60   30    NaN   50    NaN